In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('supershops.csv')
dfNormalization = df.copy()
dfStandardization = df.copy()
dfLogTransformation = df.copy()
dfRobustScaler = df.copy()
dfMaxAbsoluteScaler = df.copy()

In [3]:
float_columns = df.select_dtypes(exclude='object').columns
float_columns

Index(['Marketing Spend', 'Administration', 'Transport', 'Profit'], dtype='object')

# Perform Normalization using loop

In [4]:
from sklearn.preprocessing import MinMaxScaler

In [5]:
normalizationSclr = MinMaxScaler()
for column in float_columns:
    dfNormalization[column] = normalizationSclr.fit_transform(dfNormalization[[column]])

In [6]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [7]:
dfNormalization.head()

   Marketing Spend  Administration  Transport     Area    Profit
0         0.692617        0.651744   1.000000    Dhaka  1.000000
1         0.983359        0.761972   0.940893      Ctg  0.997355
2         0.927985        0.379579   0.864664  Rangpur  0.993178
3         0.873136        0.512998   0.812235    Dhaka  0.947292
4         0.859438        0.305328   0.776136  Rangpur  0.853171

# Standardization

In [8]:
from sklearn.preprocessing import StandardScaler
standardizationSclr = StandardScaler()

In [9]:
for column in float_columns:
    dfStandardization[column] = standardizationSclr.fit_transform(dfStandardization[[column]])

In [10]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [11]:
dfStandardization.head()

   Marketing Spend  Administration  Transport     Area    Profit
0         0.897913        0.560753   2.165287    Dhaka  2.011203
1         1.955860        1.082807   1.929843      Ctg  1.999430
2         1.754364       -0.728257   1.626191  Rangpur  1.980842
3         1.554784       -0.096365   1.417348    Dhaka  1.776627
4         1.504937       -1.079919   1.273550  Rangpur  1.357740

# Log Transformation

In [12]:
from sklearn.preprocessing import FunctionTransformer

In [13]:
LogTransformationFT = FunctionTransformer(np.log1p)

In [14]:
for column in float_columns:
    dfLogTransformation[column] = LogTransformationFT.fit_transform(dfLogTransformation[[column]])

In [15]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [16]:
dfLogTransformation.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        11.648545       11.826997  13.064279    Dhaka  12.166619
1        11.999040       11.927539  13.003354      Ctg  12.164172
2        11.941081       11.524326  12.918864  Rangpur  12.160298
3        11.880158       11.684126  12.856314    Dhaka  12.116711
4        11.864345       11.422922  12.810851  Rangpur  12.020881

# Robust Scalaer

In [17]:
from sklearn.preprocessing import RobustScaler

In [18]:
RobustSclr = RobustScaler()
for column in float_columns:
    dfRobustScaler[column] = RobustSclr.fit_transform(dfRobustScaler[[column]])

In [19]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [20]:
dfRobustScaler.head()

   Marketing Spend  Administration  Transport     Area    Profit
0         0.672530        0.345355   1.552016    Dhaka  1.698340
1         1.452113        0.697565   1.383714      Ctg  1.688874
2         1.303634       -0.524290   1.166654  Rangpur  1.673929
3         1.156567       -0.097977   1.017368    Dhaka  1.509736
4         1.119836       -0.761543   0.914576  Rangpur  1.172943

# Max Absolute Scaler

In [21]:
from sklearn.preprocessing import MaxAbsScaler

In [22]:
MaxAbsSclr = MaxAbsScaler()
for column in float_columns:
    dfMaxAbsoluteScaler[column] = MaxAbsSclr.fit_transform(dfMaxAbsoluteScaler[[column]])

In [23]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [24]:
dfMaxAbsoluteScaler.head()

   Marketing Spend  Administration  Transport     Area    Profit
0         0.692617        0.749527   1.000000    Dhaka  1.000000
1         0.983359        0.828805   0.940893      Ctg  0.997557
2         0.927985        0.553781   0.864664  Rangpur  0.993699
3         0.873136        0.649738   0.812235    Dhaka  0.951317
4         0.859438        0.500378   0.776136  Rangpur  0.864383